bkempers/baremetal-rtos/HAL/src/stm32h7rs_hal_i2c.c
#include "stm32h7rs_hal_i2c.h"
#include "stm32h7s3xx.h"

#define I2C_NO_OPTION_FRAME (0xFFFF0000U)

#define MAX_NBYTE_SIZE 255U

/* Private define to centralize the enable/disable of Interrupts */
#define I2C_XFER_TX_IT     (uint16_t) (0x0001U) /*!< Bit field can be combinated with @ref I2C_XFER_LISTEN_IT */
#define I2C_XFER_RX_IT     (uint16_t) (0x0002U) /*!< Bit field can be combinated with @ref I2C_XFER_LISTEN_IT */
#define I2C_XFER_LISTEN_IT (uint16_t) (0x8000U) /*!< Bit field can be combinated with @ref I2C_XFER_TX_IT and @ref I2C_XFER_RX_IT */
#define I2C_XFER_ERROR_IT  (uint16_t) (0x0010U) /*!< Bit definition to manage addition of global Error and NACK treatment */
#define I2C_XFER_CPLT_IT   (uint16_t) (0x0020U) /*!< Bit definition to manage only STOP evenement */
#define I2C_XFER_RELOAD_IT (uint16_t) (0x0040U) /*!< Bit definition to manage only Reload of NBYTE */

/* Private define for @ref PreviousState usage */
#define I2C_STATE_MSK                                                                                                                                \
    ((uint32_t) ((uint32_t) ((uint32_t) HAL_I2C_STATE_BUSY_TX | (uint32_t) HAL_I2C_STATE_BUSY_RX) & (uint32_t) (~((uint32_t) HAL_I2C_STATE_READY))))
/*!< Mask State define, keep only RX and TX bits */
#define I2C_STATE_NONE ((uint32_t) (HAL_I2C_MODE_NONE))
/*!< Default Value */
#define I2C_STATE_MASTER_BUSY_TX ((uint32_t) (((uint32_t) HAL_I2C_STATE_BUSY_TX & I2C_STATE_MSK) | (uint32_t) HAL_I2C_MODE_MASTER))
/*!< Master Busy TX, combinaison of State LSB and Mode enum */
#define I2C_STATE_MASTER_BUSY_RX ((uint32_t) (((uint32_t) HAL_I2C_STATE_BUSY_RX & I2C_STATE_MSK) | (uint32_t) HAL_I2C_MODE_MASTER))
/*!< Master Busy RX, combinaison of State LSB and Mode enum */
#define I2C_STATE_SLAVE_BUSY_TX ((uint32_t) (((uint32_t) HAL_I2C_STATE_BUSY_TX & I2C_STATE_MSK) | (uint32_t) HAL_I2C_MODE_SLAVE))
/*!< Slave Busy TX, combinaison of State LSB and Mode enum */
#define I2C_STATE_SLAVE_BUSY_RX ((uint32_t) (((uint32_t) HAL_I2C_STATE_BUSY_RX & I2C_STATE_MSK) | (uint32_t) HAL_I2C_MODE_SLAVE))
/*!< Slave Busy RX, combinaison of State LSB and Mode enum  */
#define I2C_STATE_MEM_BUSY_TX ((uint32_t) (((uint32_t) HAL_I2C_STATE_BUSY_TX & I2C_STATE_MSK) | (uint32_t) HAL_I2C_MODE_MEM))
/*!< Memory Busy TX, combinaison of State LSB and Mode enum */
#define I2C_STATE_MEM_BUSY_RX ((uint32_t) (((uint32_t) HAL_I2C_STATE_BUSY_RX & I2C_STATE_MSK) | (uint32_t) HAL_I2C_MODE_MEM))
/*!< Memory Busy RX, combinaison of State LSB and Mode enum */

static HAL_Status I2C_WaitOnFlagUntilTimeout(I2C_Handle *handle, uint32_t Flag, FlagStatus Status, uint32_t Timeout, uint32_t Tickstart);
static HAL_Status I2C_IsErrorOccurred(I2C_Handle *handle, uint32_t Timeout, uint32_t Tickstart);
static void       I2C_Flush_TXDR(I2C_Handle *handle);
static void       I2C_TreatErrorCallback(I2C_Handle *handle);

static HAL_Status I2C_Master_ISR_IT(struct __I2C_Handle *handle, uint32_t ITFlags, uint32_t ITSources);
static HAL_Status I2C_Mem_ISR_IT(struct __I2C_Handle *handle, uint32_t ITFlags, uint32_t ITSources);

// static void I2C_ITAddrCplt(I2C_HandleTypeDef *hi2c, uint32_t ITFlags);
// static void I2C_ITSlaveSeqCplt(I2C_HandleTypeDef *hi2c);
// static void I2C_ITSlaveCplt(I2C_HandleTypeDef *hi2c, uint32_t ITFlags);
// static void I2C_ITListenCplt(I2C_HandleTypeDef *hi2c, uint32_t ITFlags);

static void I2C_ITMasterCplt(I2C_Handle *handle, uint32_t ITFlags);
static void I2C_ITMasterSeqCplt(I2C_Handle *handle);
static void I2C_ITError(I2C_Handle *handle, uint32_t ErrorCode);

static void I2C_Enable_IRQ(I2C_Handle *handle, uint16_t InterruptRequest);
static void I2C_Disable_IRQ(I2C_Handle *handle, uint16_t InterruptRequest);
static void I2C_TransferConfig(I2C_Handle *handle, uint16_t DevAddress, uint8_t Size, uint32_t Mode, uint32_t Request);

HAL_Status HAL_I2C_Init(I2C_Handle *handle)
{
    if (handle == NULL) {
        return HAL_ERROR;
    }

    handle->State = HAL_I2C_STATE_BUSY;

    CLEAR_BIT(handle->Instance->CR1, I2C_CR1_PE);

    handle->Instance->TIMINGR = handle->Init.Timing & TIMING_CLEAR_MASK;

    handle->Instance->OAR1 &= ~I2C_OAR1_OA1EN;
    if (handle->Init.AddressingMode == I2C_ADDRESSINGMODE_7BIT) {
        handle->Instance->OAR1 = (I2C_OAR1_OA1EN | handle->Init.OwnAddress1);
    } else /* I2C_ADDRESSINGMODE_10BIT */ {
        handle->Instance->OAR1 = (I2C_OAR1_OA1EN | I2C_OAR1_OA1MODE | handle->Init.OwnAddress1);
    }

    if (handle->Init.AddressingMode == I2C_ADDRESSINGMODE_10BIT) {
        SET_BIT(handle->Instance->CR2, I2C_CR2_ADD10);
    } else {
        CLEAR_BIT(handle->Instance->CR2, I2C_CR2_ADD10);
    }

    handle->Instance->CR2 |= (I2C_CR2_AUTOEND | I2C_CR2_NACK);
    handle->Instance->OAR2 &= ~I2C_OAR2_OA2EN;
    handle->Instance->OAR2 = (handle->Init.DualAddressMode | handle->Init.OwnAddress2 | (handle->Init.OwnAddress2Masks << 8));
    handle->Instance->CR1  = (handle->Init.GeneralCallMode | handle->Init.NoStretchMode);

    SET_BIT(handle->Instance->CR1, I2C_CR1_PE);

    handle->ErrorCode     = HAL_I2C_ERROR_NONE;
    handle->State         = HAL_I2C_STATE_READY;
    handle->PreviousState = (uint32_t) HAL_I2C_MODE_NONE;
    handle->Mode          = HAL_I2C_MODE_NONE;

    return HAL_OK;
}

HAL_Status HAL_I2C_DeInit(I2C_Handle *handle)
{
    // TODO: implement later
    return HAL_OK;
}

HAL_Status HAL_I2C_IsDeviceReady(I2C_Handle *handle, uint16_t DevAddress, uint32_t Trials, uint32_t Timeout)
{
    uint32_t tickstart;

    __IO uint32_t I2C_Trials = 0UL;

    HAL_Status status = HAL_OK;

    FlagStatus tmp1;
    FlagStatus tmp2;

    if (handle->State == HAL_I2C_STATE_READY) {
        if (((((handle->Instance->ISR) & I2C_ISR_BUSY) == I2C_ISR_BUSY) ? SET : RESET) == SET) {
            return HAL_BUSY;
        }

        handle->State     = HAL_I2C_STATE_BUSY;
        handle->ErrorCode = HAL_I2C_ERROR_NONE;

        do {
            /* Generate Start */
            handle->Instance->CR2 = I2C_GENERATE_START(handle->Init.AddressingMode, DevAddress);

            /* No need to Check TC flag, with AUTOEND mode the stop is automatically generated */
            /* Wait until STOPF flag is set or a NACK flag is set*/
            tickstart = HAL_GetTick();

