bkempers/baremetal-rtos/HAL/src/stm32h7rs_hal_i2c.c
            tmp1 = (handle->Instance->ISR & (I2C_ISR_STOPF)) == I2C_ISR_STOPF ? SET : RESET;
            tmp2 = (handle->Instance->ISR & (I2C_ISR_NACKF)) == I2C_ISR_NACKF ? SET : RESET;

            while ((tmp1 == RESET) && (tmp2 == RESET)) {
                if (Timeout != HAL_MAX_DELAY) {
                    if (((HAL_GetTick() - tickstart) > Timeout) || (Timeout == 0U)) {
                        /* Update I2C state */
                        handle->State = HAL_I2C_STATE_READY;

                        /* Update I2C error code */
                        handle->ErrorCode |= HAL_I2C_ERROR_TIMEOUT;

                        return HAL_ERROR;
                    }
                }

                tmp1 = (handle->Instance->ISR & (I2C_ISR_STOPF)) == I2C_ISR_STOPF ? SET : RESET;
                tmp2 = (handle->Instance->ISR & (I2C_ISR_NACKF)) == I2C_ISR_NACKF ? SET : RESET;
            }

            /* Check if the NACKF flag has not been set */
            if (((handle->Instance->ISR & (I2C_ISR_NACKF)) == I2C_ISR_NACKF ? SET : RESET) == RESET) {
                /* Wait until STOPF flag is reset */
                if (I2C_WaitOnFlagUntilTimeout(handle, I2C_ISR_STOPF, RESET, Timeout, tickstart) != HAL_OK) {
                    /* A non acknowledge appear during STOP Flag waiting process, a new trial must be performed */
                    if (handle->ErrorCode == HAL_I2C_ERROR_AF) {
                        /* Clear STOP Flag */
                        handle->Instance->ICR = I2C_ISR_STOPF;

                        /* Reset the error code for next trial */
                        handle->ErrorCode = HAL_I2C_ERROR_NONE;
                    } else {
                        status = HAL_ERROR;
                    }
                } else {
                    /* A acknowledge appear during STOP Flag waiting process, this mean that device respond to its address */

                    /* Clear STOP Flag */
                    handle->Instance->ICR = I2C_ISR_STOPF;

                    /* Device is ready */
                    handle->State = HAL_I2C_STATE_READY;
                    return HAL_OK;
                }
            } else {
                /* A non acknowledge is detected, this mean that device not respond to its address,
                   a new trial must be performed */

                /* Clear NACK Flag */
                handle->Instance->ICR = I2C_ISR_NACKF;

                /* Wait until STOPF flag is reset */
                if (I2C_WaitOnFlagUntilTimeout(handle, I2C_ISR_STOPF, RESET, Timeout, tickstart) != HAL_OK) {
                    status = HAL_ERROR;
                } else {
                    /* Clear STOP Flag, auto generated with autoend*/
                    handle->Instance->ICR = I2C_ISR_STOPF;
                }
            }

            /* Increment Trials */
            I2C_Trials++;

            if ((I2C_Trials < Trials) && (status == HAL_ERROR)) {
                status = HAL_OK;
            }

        } while (I2C_Trials < Trials);

        /* Update I2C state */
        handle->State = HAL_I2C_STATE_READY;

        /* Update I2C error code */
        handle->ErrorCode |= HAL_I2C_ERROR_TIMEOUT;
        return HAL_ERROR;
    } else {
        return HAL_BUSY;
    }
}

static HAL_Status I2C_WaitOnFlagUntilTimeout(I2C_Handle *handle, uint32_t Flag, FlagStatus Status, uint32_t Timeout, uint32_t Tickstart)
{
    while (((((handle->Instance->ISR) & Flag) == Flag) ? SET : RESET) == Status) {
        /* Check if an error is detected */
        if (I2C_IsErrorOccurred(handle, Timeout, Tickstart) != HAL_OK) {
            return HAL_ERROR;
        }

        /* Check for the Timeout */
        if (Timeout != HAL_MAX_DELAY) {
            if (((HAL_GetTick() - Tickstart) > Timeout) || (Timeout == 0U)) {
                if (((((handle->Instance->ISR) & Flag) == Flag) ? SET : RESET) == Status) {
                    handle->ErrorCode |= HAL_I2C_ERROR_TIMEOUT;
                    handle->State = HAL_I2C_STATE_READY;
                    handle->Mode  = HAL_I2C_MODE_NONE;
                    return HAL_ERROR;
                }
            }
        }
    }
    return HAL_OK;
}

static HAL_Status I2C_IsErrorOccurred(I2C_Handle *handle, uint32_t Timeout, uint32_t Tickstart)
{
    HAL_Status   status     = HAL_OK;
    uint32_t     itflag     = handle->Instance->ISR;
    uint32_t     error_code = 0;
    uint32_t     tickstart  = Tickstart;
    uint32_t     tmp1;
    HAL_I2C_Mode tmp2;

    if (HAL_IS_BIT_SET(itflag, I2C_ISR_NACKF)) {
        /* Clear NACKF Flag */
        handle->Instance->ICR = I2C_ISR_NACKF;

        /* Wait until STOP Flag is set or timeout occurred */
        /* AutoEnd should be initiate after AF */
        while ((((((handle->Instance->ISR) & I2C_ISR_STOPF) == I2C_ISR_STOPF) ? SET : RESET) == RESET) && (status == HAL_OK)) {
            /* Check for the Timeout */
            if (Timeout != HAL_MAX_DELAY) {
                if (((HAL_GetTick() - tickstart) > Timeout) || (Timeout == 0U)) {
                    tmp1 = (uint32_t) (handle->Instance->CR2 & I2C_CR2_STOP);
                    tmp2 = handle->Mode;

                    /* In case of I2C still busy, try to regenerate a STOP manually */
                    if ((((((handle->Instance->ISR) & I2C_ISR_BUSY) == I2C_ISR_BUSY) ? SET : RESET) != RESET) && (tmp1 != I2C_CR2_STOP) &&
                        (tmp2 != HAL_I2C_MODE_SLAVE)) {
                        /* Generate Stop */
                        handle->Instance->CR2 |= I2C_CR2_STOP;

                        /* Update Tick with new reference */
                        tickstart = HAL_GetTick();
                    }

                    while (((((handle->Instance->ISR) & I2C_ISR_STOPF) == I2C_ISR_STOPF) ? SET : RESET) == RESET) {
                        /* Check for the Timeout */
                        if ((HAL_GetTick() - tickstart) > I2C_TIMEOUT_STOPF) {
                            error_code |= HAL_I2C_ERROR_TIMEOUT;
                            status = HAL_ERROR;
                            break;
                        }
                    }
                }
            }
        }

