bkempers/baremetal-rtos/HAL/src/stm32h7rs_hal_i2c.c
        /* In case STOP Flag is detected, clear it */
        if (status == HAL_OK) {
            /* Clear STOP Flag */
            handle->Instance->ICR = I2C_ISR_STOPF;
        }
        error_code |= HAL_I2C_ERROR_AF;
        status = HAL_ERROR;
    }

    /* Refresh Content of Status register */
    itflag = handle->Instance->ISR;

    /* Then verify if an additional errors occurs */
    /* Check if a Bus error occurred */
    if (HAL_IS_BIT_SET(itflag, I2C_ISR_BERR)) {
        error_code |= HAL_I2C_ERROR_BERR;

        /* Clear BERR flag */
        handle->Instance->ICR = I2C_ISR_BERR;
        status                = HAL_ERROR;
    }

    /* Check if an Over-Run/Under-Run error occurred */
    if (HAL_IS_BIT_SET(itflag, I2C_ISR_OVR)) {
        error_code |= HAL_I2C_ERROR_OVR;

        /* Clear OVR flag */
        handle->Instance->ICR = I2C_ISR_OVR;
        status                = HAL_ERROR;
    }

    /* Check if an Arbitration Loss error occurred */
    if (HAL_IS_BIT_SET(itflag, I2C_ISR_ARLO)) {
        error_code |= HAL_I2C_ERROR_ARLO;

        /* Clear ARLO flag */
        handle->Instance->ICR = I2C_ISR_ARLO;
        status                = HAL_ERROR;
    }

    if (status != HAL_OK) {
        /* Flush TX register */
        I2C_Flush_TXDR(handle);

        /* Clear Configuration Register 2 */
        handle->Instance->CR2 &= (uint32_t) ~((uint32_t) (I2C_CR2_SADD | I2C_CR2_HEAD10R | I2C_CR2_NBYTES | I2C_CR2_RELOAD | I2C_CR2_RD_WRN));

        handle->ErrorCode |= error_code;
        handle->State = HAL_I2C_STATE_READY;
        handle->Mode  = HAL_I2C_MODE_NONE;
    }

    return status;
}

static void I2C_Flush_TXDR(I2C_Handle *handle)
{
    /* If a pending TXIS flag is set */
    /* Write a dummy data in TXDR to clear it */
    if (((((handle->Instance->ISR) & I2C_ISR_TXIS) == I2C_ISR_TXIS) ? SET : RESET) != RESET) {
        handle->Instance->TXDR = 0x00U;
    }

    /* Flush TX register if not empty */
    if (((((handle->Instance->ISR) & I2C_ISR_TXE) == I2C_ISR_TXE) ? SET : RESET) == RESET) {
        handle->Instance->ISR |= I2C_ISR_TXE;
    }
}

HAL_Status HAL_I2C_Master_TX_IT(I2C_Handle *handle, uint32_t DevAddress, uint8_t *ptrData, uint16_t Size)
{
    uint32_t tx_mode;

    if (handle->State == HAL_I2C_STATE_READY) {
        if (((((handle->Instance->ISR) & I2C_ISR_BUSY) == I2C_ISR_BUSY) ? SET : RESET) == SET) {
            return HAL_BUSY;
        }

        handle->State     = HAL_I2C_STATE_BUSY_TX;
        handle->Mode      = HAL_I2C_MODE_MASTER;
        handle->ErrorCode = HAL_I2C_ERROR_NONE;

        /* Prepare transfer parameters */
        handle->buffPtr     = ptrData;
        handle->xferCount   = Size;
        handle->xferOptions = I2C_NO_OPTION_FRAME;
        handle->xferISR     = I2C_Master_ISR_IT;

        if (handle->xferCount > MAX_NBYTE_SIZE) {
            handle->xferSize = MAX_NBYTE_SIZE;
            tx_mode          = I2C_RELOAD_MODE;
        } else {
            handle->xferSize = handle->xferCount;
            tx_mode          = I2C_AUTOEND_MODE;
        }

        /* Send Slave Address */
        /* Set NBYTES to write and reload if hi2c->XferCount > MAX_NBYTE_SIZE */
        I2C_TransferConfig(handle, DevAddress, (uint8_t) handle->xferSize, tx_mode, I2C_GENERATE_START_WRITE);

        /* Note : The I2C interrupts must be enabled after unlocking current process
                  to avoid the risk of I2C interrupt handle execution before current
                  process unlock */

        /* Enable ERR, TC, STOP, NACK, TXI interrupt */
        /* possible to enable all of these */
        /* I2C_IT_ERRI | I2C_IT_TCI | I2C_IT_STOPI | I2C_IT_NACKI |
          I2C_IT_ADDRI | I2C_IT_RXI | I2C_IT_TXI */
        I2C_Enable_IRQ(handle, I2C_XFER_TX_IT);

        return HAL_OK;
    } else {
        return HAL_BUSY;
    }
}

HAL_Status HAL_I2C_Master_RX_IT(I2C_Handle *handle, uint16_t DevAddress, uint8_t *ptrData, uint16_t Size)
{
    uint32_t rx_mode;

    if (handle->State == HAL_I2C_STATE_READY) {
        if (((((handle->Instance->ISR) & I2C_ISR_BUSY) == I2C_ISR_BUSY) ? SET : RESET) == SET) {
            return HAL_BUSY;
        }

        handle->State     = HAL_I2C_STATE_BUSY_RX;
        handle->Mode      = HAL_I2C_MODE_MASTER;
        handle->ErrorCode = HAL_I2C_ERROR_NONE;

        /* Prepare transfer parameters */
        handle->buffPtr     = ptrData;
        handle->xferCount   = Size;
        handle->xferOptions = I2C_NO_OPTION_FRAME;
        handle->xferISR     = I2C_Master_ISR_IT;

        if (handle->xferCount > MAX_NBYTE_SIZE) {
            handle->xferSize = MAX_NBYTE_SIZE;
            rx_mode          = I2C_RELOAD_MODE;
        } else {
            handle->xferSize = handle->xferCount;
            rx_mode          = I2C_AUTOEND_MODE;
        }

        /* Send Slave Address */
        /* Set NBYTES to write and reload if hi2c->XferCount > MAX_NBYTE_SIZE */
        I2C_TransferConfig(handle, DevAddress, (uint8_t) handle->xferSize, rx_mode, I2C_GENERATE_START_READ);

        /* Note : The I2C interrupts must be enabled after unlocking current process
                  to avoid the risk of I2C interrupt handle execution before current
                  process unlock */

        /* Enable ERR, TC, STOP, NACK, RXI interrupt */
        /* possible to enable all of these */
        /* I2C_IT_ERRI | I2C_IT_TCI | I2C_IT_STOPI | I2C_IT_NACKI |
          I2C_IT_ADDRI | I2C_IT_RXI | I2C_IT_TXI */
        I2C_Enable_IRQ(handle, I2C_XFER_RX_IT);

        return HAL_OK;
    } else {
        return HAL_BUSY;
    }
}

static void I2C_TransferConfig(I2C_Handle *handle, uint16_t DevAddress, uint8_t Size, uint32_t Mode, uint32_t Request)
{
    uint32_t tmpreg;

    /* Read current CR2 value */
    tmpreg = handle->Instance->CR2;
    
    /* Clear the bits we're about to configure */
    tmpreg &= ~(I2C_CR2_SADD | I2C_CR2_NBYTES | I2C_CR2_RELOAD | I2C_CR2_AUTOEND | 
                I2C_CR2_RD_WRN | I2C_CR2_START | I2C_CR2_STOP);
    
    /* Set slave address */
    tmpreg |= (DevAddress & I2C_CR2_SADD);
    
