bkempers/baremetal-rtos/HAL/src/stm32h7rs_hal_i2c.c
    /* Set number of bytes */
    tmpreg |= ((uint32_t)Size << I2C_CR2_NBYTES_Pos) & I2C_CR2_NBYTES;
    
    /* Set mode (RELOAD, AUTOEND, or SOFTEND) */
    tmpreg |= Mode;
    
    /* Set START/STOP and direction from Request parameter */
    /* Mask off the sentinel bit 31 from Request */
    tmpreg |= (Request & ~0x80000000U);
    
    /* Write back to CR2 */
    handle->Instance->CR2 = tmpreg;
}

static HAL_Status I2C_Master_ISR_IT(struct __I2C_Handle *handle, uint32_t ITFlags, uint32_t ITSources)
{
    uint16_t devaddress;
    uint32_t tmpITFlags = ITFlags;

    if ((I2C_CHECK_FLAG(tmpITFlags, I2C_ISR_NACKF) != RESET) && (I2C_CHECK_IT_SOURCE(ITSources, I2C_CR1_NACKIE) != RESET)) {
        /* Clear NACK Flag */
        handle->Instance->ISR = I2C_ISR_NACKF;

        /* Set corresponding Error Code */
        /* No need to generate STOP, it is automatically done */
        /* Error callback will be send during stop flag treatment */
        handle->ErrorCode |= HAL_I2C_ERROR_AF;

        /* Flush TX register */
        I2C_Flush_TXDR(handle);
    } else if ((I2C_CHECK_FLAG(tmpITFlags, I2C_ISR_RXNE) != RESET) && (I2C_CHECK_IT_SOURCE(ITSources, I2C_CR1_RXIE) != RESET)) {
        /* Remove RXNE flag on temporary variable as read done */
        tmpITFlags &= ~I2C_ISR_RXNE;

        /* Read data from RXDR */
        *handle->buffPtr = (uint8_t) handle->Instance->RXDR;

        /* Increment Buffer pointer */
        handle->buffPtr++;
        handle->xferSize--;
        handle->xferCount--;
    } else if ((I2C_CHECK_FLAG(tmpITFlags, I2C_ISR_TXIS) != RESET) && (I2C_CHECK_IT_SOURCE(ITSources, I2C_CR1_TXIE) != RESET)) {
        /* Write data to TXDR */
        handle->Instance->TXDR = *handle->buffPtr;

        /* Increment Buffer pointer */
        handle->buffPtr++;
        handle->xferSize--;
        handle->xferCount--;
    } else if ((I2C_CHECK_FLAG(tmpITFlags, I2C_ISR_TCR) != RESET) && (I2C_CHECK_IT_SOURCE(ITSources, I2C_CR1_TCIE) != RESET)) {
        if ((handle->xferCount != 0U) && (handle->xferSize == 0U)) {
            devaddress = (uint16_t) (handle->Instance->CR2 & I2C_CR2_SADD);

            if (handle->xferCount > MAX_NBYTE_SIZE) {
                handle->xferSize = MAX_NBYTE_SIZE;
                I2C_TransferConfig(handle, devaddress, (uint8_t) handle->xferSize, I2C_RELOAD_MODE, I2C_NO_STARTSTOP);
            } else {
                handle->xferSize = handle->xferCount;
                if (handle->xferOptions != I2C_NO_OPTION_FRAME) {
                    I2C_TransferConfig(handle, devaddress, (uint8_t) handle->xferSize, handle->xferOptions, I2C_NO_STARTSTOP);
                } else {
                    I2C_TransferConfig(handle, devaddress, (uint8_t) handle->xferSize, I2C_AUTOEND_MODE, I2C_NO_STARTSTOP);
                }
            }
        } else {
            /* Call TxCpltCallback() if no stop mode is set */
            if ((handle->Instance->CR2 & I2C_CR2_AUTOEND) != I2C_AUTOEND_MODE) {
                /* Call I2C Master Sequential complete process */
                I2C_ITMasterSeqCplt(handle);
            } else {
                /* Wrong size Status regarding TCR flag event */
                /* Call the corresponding callback to inform upper layer of End of Transfer */
                I2C_ITError(handle, HAL_I2C_ERROR_SIZE);
            }
        }
    } else if ((I2C_CHECK_FLAG(tmpITFlags, I2C_ISR_TC) != RESET) && (I2C_CHECK_IT_SOURCE(ITSources, I2C_CR1_TCIE) != RESET)) {
        if (handle->xferCount == 0U) {
            if ((handle->Instance->CR2 & I2C_CR2_AUTOEND) != I2C_AUTOEND_MODE) {
                /* Generate a stop condition in case of no transfer option */
                if (handle->xferOptions == I2C_NO_OPTION_FRAME) {
                    /* Generate Stop */
                    handle->Instance->CR2 |= I2C_CR2_STOP;
                } else {
                    /* Call I2C Master Sequential complete process */
                    I2C_ITMasterSeqCplt(handle);
                }
            }
        } else {
            /* Wrong size Status regarding TC flag event */
            /* Call the corresponding callback to inform upper layer of End of Transfer */
            I2C_ITError(handle, HAL_I2C_ERROR_SIZE);
        }
    } else {
        /* Nothing to do */
    }

    if ((I2C_CHECK_FLAG(tmpITFlags, I2C_ISR_STOPF) != RESET) && (I2C_CHECK_IT_SOURCE(ITSources, I2C_CR1_STOPIE) != RESET)) {
        /* Call I2C Master complete process */
        I2C_ITMasterCplt(handle, tmpITFlags);
    }

    return HAL_OK;
}

static void I2C_Enable_IRQ(I2C_Handle *handle, uint16_t InterruptRequest)
{
    uint32_t tmpisr = 0U;

    if ((InterruptRequest & I2C_XFER_LISTEN_IT) == I2C_XFER_LISTEN_IT) {
        /* Enable ERR, STOP, NACK and ADDR interrupts */
        tmpisr |= I2C_CR1_ADDRIE | I2C_CR1_STOPIE | I2C_CR1_NACKIE | I2C_CR1_ERRIE;
    }

    if ((InterruptRequest & I2C_XFER_TX_IT) == I2C_XFER_TX_IT) {
        /* Enable ERR, TC, STOP, NACK and TXI interrupts */
        tmpisr |= I2C_CR1_ERRIE | I2C_CR1_TCIE | I2C_CR1_STOPIE | I2C_CR1_NACKIE | I2C_CR1_TXIE;
    }

    if ((InterruptRequest & I2C_XFER_RX_IT) == I2C_XFER_RX_IT) {
        /* Enable ERR, TC, STOP, NACK and RXI interrupts */
        tmpisr |= I2C_CR1_ERRIE | I2C_CR1_TCIE | I2C_CR1_STOPIE | I2C_CR1_NACKIE | I2C_CR1_RXIE;
    }

    if (InterruptRequest == I2C_XFER_ERROR_IT) {
        /* Enable ERR and NACK interrupts */
        tmpisr |= I2C_CR1_ERRIE | I2C_CR1_NACKIE;
    }

    if (InterruptRequest == I2C_XFER_CPLT_IT) {
        /* Enable STOP interrupts */
        tmpisr |= I2C_CR1_STOPIE;
    }

    /* Enable interrupts only at the end */
    /* to avoid the risk of I2C interrupt handle execution before */
    /* all interrupts requested done */
    handle->Instance->CR1 |= tmpisr;
}

static void I2C_Disable_IRQ(I2C_Handle *handle, uint16_t InterruptRequest)
{
    uint32_t tmpisr = 0U;

    if ((InterruptRequest & I2C_XFER_TX_IT) == I2C_XFER_TX_IT) {
        /* Disable TC and TXI interrupts */
        tmpisr |= I2C_CR1_TCIE | I2C_CR1_TXIE;

        if (((uint32_t) handle->State & (uint32_t) HAL_I2C_STATE_LISTEN) != (uint32_t) HAL_I2C_STATE_LISTEN) {
            /* Disable NACK and STOP interrupts */
            tmpisr |= I2C_CR1_STOPIE | I2C_CR1_NACKIE | I2C_CR1_ERRIE;
        }
    }

