bkempers/baremetal-rtos/HAL/src/stm32h7rs_hal_i2c.c
    if ((InterruptRequest & I2C_XFER_RX_IT) == I2C_XFER_RX_IT) {
        /* Disable TC and RXI interrupts */
        tmpisr |= I2C_CR1_TCIE | I2C_CR1_RXIE;

        if (((uint32_t) handle->State & (uint32_t) HAL_I2C_STATE_LISTEN) != (uint32_t) HAL_I2C_STATE_LISTEN) {
            /* Disable NACK and STOP interrupts */
            tmpisr |= I2C_CR1_STOPIE | I2C_CR1_NACKIE | I2C_CR1_ERRIE;
        }
    }

    if ((InterruptRequest & I2C_XFER_LISTEN_IT) == I2C_XFER_LISTEN_IT) {
        /* Disable ADDR, NACK and STOP interrupts */
        tmpisr |= I2C_CR1_ADDRIE | I2C_CR1_STOPIE | I2C_CR1_NACKIE | I2C_CR1_ERRIE;
    }

    if (InterruptRequest == I2C_XFER_ERROR_IT) {
        /* Enable ERR and NACK interrupts */
        tmpisr |= I2C_CR1_ERRIE | I2C_CR1_NACKIE;
    }

    if (InterruptRequest == I2C_XFER_CPLT_IT) {
        /* Enable STOP interrupts */
        tmpisr |= I2C_CR1_STOPIE;
    }

    if (InterruptRequest == I2C_XFER_RELOAD_IT) {
        /* Enable TC interrupts */
        tmpisr |= I2C_CR1_TCIE;
    }

    /* Disable interrupts only at the end */
    /* to avoid a breaking situation like at "t" time */
    /* all disable interrupts request are not done */
    handle->Instance->CR1 &= ~(tmpisr);
}

// HAL_Status HAL_I2C_Slave_TX_IT(I2C_Handle *handle, uint8_t *ptrData, uint16_t Size);
// HAL_Status HAL_I2C_Slave_RX_IT(I2C_Handle *handle, uint8_t *ptrData, uint16_t Size);

HAL_Status HAL_I2C_Mem_Write_IT(I2C_Handle *handle, uint16_t DevAddress, uint16_t MemAddress, uint16_t MemAddSize, uint8_t *ptrData, uint16_t Size)
{
    if (handle->State == HAL_I2C_STATE_READY) {
        if ((ptrData == NULL) || (Size == 0U)) {
            handle->ErrorCode = HAL_I2C_ERROR_INVALID_PARAM;
            return HAL_ERROR;
        }

        if (((((handle->Instance->ISR) & I2C_ISR_BUSY) == I2C_ISR_BUSY) ? SET : RESET) == SET) {
            return HAL_BUSY;
        }

        handle->State     = HAL_I2C_STATE_BUSY_TX;
        handle->Mode      = HAL_I2C_MODE_MEM;
        handle->ErrorCode = HAL_I2C_ERROR_NONE;

        /* Prepare transfer parameters */
        handle->xferSize    = 0U;
        handle->buffPtr     = ptrData;
        handle->xferCount   = Size;
        handle->xferOptions = I2C_NO_OPTION_FRAME;
        handle->xferISR     = I2C_Mem_ISR_IT;
        handle->DevAddress  = DevAddress;

        /* If Memory address size is 8Bit */
        if (MemAddSize == I2C_MEMADD_SIZE_8BIT) {
            // /* Prefetch Memory Address */
            // handle->Instance->TXDR = I2C_MEM_ADD_LSB(MemAddress);
            //
            // /* Reset Memaddress content */
            // handle->MemAddress = 0xFFFFFFFFU;

            handle->MemAddress = I2C_MEM_ADD_LSB(MemAddress);
        }
        /* If Memory address size is 16Bit */
        else {
            /* Prefetch Memory Address (MSB part, LSB will be manage through interrupt) */
            handle->Instance->TXDR = I2C_MEM_ADD_MSB(MemAddress);

            /* Prepare Memaddress buffer for LSB part */
            handle->MemAddress = I2C_MEM_ADD_LSB(MemAddress);
        }

        /* Send Slave Address and Memory Address */
        I2C_TransferConfig(handle, DevAddress, (uint8_t) MemAddSize, I2C_RELOAD_MODE, I2C_GENERATE_START_WRITE);

        /* Note : The I2C interrupts must be enabled after unlocking current process
                  to avoid the risk of I2C interrupt handle execution before current
                  process unlock */

        /* Enable ERR, TC, STOP, NACK, TXI interrupt */
        /* possible to enable all of these */
        /* I2C_IT_ERRI | I2C_IT_TCI | I2C_IT_STOPI | I2C_IT_NACKI |
          I2C_IT_ADDRI | I2C_IT_RXI | I2C_IT_TXI */
        I2C_Enable_IRQ(handle, I2C_XFER_TX_IT);

        return HAL_OK;
    } else {
        return HAL_BUSY;
    }
}

HAL_Status HAL_I2C_Mem_Read_IT(I2C_Handle *handle, uint16_t DevAddress, uint16_t MemAddress, uint16_t MemAddSize, uint8_t *ptrData, uint16_t Size)
{
    if (handle->State == HAL_I2C_STATE_READY) {
        if ((ptrData == NULL) || (Size == 0U)) {
            handle->ErrorCode = HAL_I2C_ERROR_INVALID_PARAM;
            return HAL_ERROR;
        }

        if (((((handle->Instance->ISR) & I2C_ISR_BUSY) == I2C_ISR_BUSY) ? SET : RESET) == SET) {
            return HAL_BUSY;
        }

        handle->State     = HAL_I2C_STATE_BUSY_RX;
        handle->Mode      = HAL_I2C_MODE_MEM;
        handle->ErrorCode = HAL_I2C_ERROR_NONE;

        /* Prepare transfer parameters */
        handle->buffPtr     = ptrData;
        handle->xferCount   = Size;
        handle->xferOptions = I2C_NO_OPTION_FRAME;
        handle->xferISR     = I2C_Mem_ISR_IT;
        handle->DevAddress  = DevAddress;

        /* If Memory address size is 8Bit */
        if (MemAddSize == I2C_MEMADD_SIZE_8BIT) {
            // /* Prefetch Memory Address */
            // handle->Instance->TXDR = I2C_MEM_ADD_LSB(MemAddress);
            //
            // /* Reset Memaddress content */
            // handle->MemAddress = 0xFFFFFFFFU;

            handle->MemAddress = I2C_MEM_ADD_LSB(MemAddress);
        }
        /* If Memory address size is 16Bit */
        else {
            /* Prefetch Memory Address (MSB part, LSB will be manage through interrupt) */
            handle->Instance->TXDR = I2C_MEM_ADD_MSB(MemAddress);

            /* Prepare Memaddress buffer for LSB part */
            handle->MemAddress = I2C_MEM_ADD_LSB(MemAddress);
        }

        /* Send Slave Address and Memory Address */
        I2C_TransferConfig(handle, DevAddress, (uint8_t) MemAddSize, I2C_SOFTEND_MODE, I2C_GENERATE_START_WRITE);

        /* Note : The I2C interrupts must be enabled after unlocking current process
                  to avoid the risk of I2C interrupt handle execution before current
                  process unlock */

        /* Enable ERR, TC, STOP, NACK, TXI interrupt */
        /* possible to enable all of these */
        /* I2C_IT_ERRI | I2C_IT_TCI | I2C_IT_STOPI | I2C_IT_NACKI |
          I2C_IT_ADDRI | I2C_IT_RXI | I2C_IT_TXI */
        I2C_Enable_IRQ(handle, I2C_XFER_TX_IT);

        return HAL_OK;
    } else {
        return HAL_BUSY;
    }
}

