bkempers/baremetal-rtos/HAL/src/stm32h7rs_hal_i2c.c
static HAL_Status I2C_Mem_ISR_IT(struct __I2C_Handle *handle, uint32_t ITFlags, uint32_t ITSources)
{
    uint32_t direction  = I2C_GENERATE_START_WRITE;
    uint32_t tmpITFlags = ITFlags;

    if ((I2C_CHECK_FLAG(tmpITFlags, I2C_ISR_NACKF) != RESET) && (I2C_CHECK_IT_SOURCE(ITSources, I2C_CR1_NACKIE) != RESET)) {
        /* Clear NACK Flag */
        handle->Instance->ICR = I2C_ISR_NACKF;

        /* Set corresponding Error Code */
        /* No need to generate STOP, it is automatically done */
        /* Error callback will be send during stop flag treatment */
        handle->ErrorCode |= HAL_I2C_ERROR_AF;

        /* Flush TX register */
        I2C_Flush_TXDR(handle);
    } else if ((I2C_CHECK_FLAG(tmpITFlags, I2C_ISR_RXNE) != RESET) && (I2C_CHECK_IT_SOURCE(ITSources, I2C_CR1_RXIE) != RESET)) {
        /* Remove RXNE flag on temporary variable as read done */
        tmpITFlags &= ~I2C_ISR_RXNE;

        /* Read data from RXDR */
        *handle->buffPtr = (uint8_t) handle->Instance->RXDR;

        /* Increment Buffer pointer */
        handle->buffPtr++;
        handle->xferSize--;
        handle->xferCount--;
    } else if ((I2C_CHECK_FLAG(tmpITFlags, I2C_ISR_TXIS) != RESET) && (I2C_CHECK_IT_SOURCE(ITSources, I2C_CR1_TXIE) != RESET)) {
        if (handle->MemAddress == 0xFFFFFFFFU) {
            /* Write data to TXDR */
            handle->Instance->TXDR = *handle->buffPtr;

            /* Increment Buffer pointer */
            handle->buffPtr++;
            handle->xferSize--;
            handle->xferCount--;
        } else {
            /* Write LSB part of Memory Address */
            handle->Instance->TXDR = handle->MemAddress;

            /* Reset Memaddress content */
            handle->MemAddress = 0xFFFFFFFFU;
        }
    } else if ((I2C_CHECK_FLAG(tmpITFlags, I2C_ISR_TCR) != RESET) && (I2C_CHECK_IT_SOURCE(ITSources, I2C_CR1_TCIE) != RESET)) {
        if ((handle->xferCount != 0U) && (handle->xferSize == 0U)) {
            if (handle->xferCount > MAX_NBYTE_SIZE) {
                handle->xferSize = MAX_NBYTE_SIZE;
                I2C_TransferConfig(handle, (uint16_t) handle->DevAddress, (uint8_t) handle->xferSize, I2C_RELOAD_MODE, I2C_NO_STARTSTOP);
            } else {
                handle->xferSize = handle->xferCount;
                I2C_TransferConfig(handle, (uint16_t) handle->DevAddress, (uint8_t) handle->xferSize, I2C_AUTOEND_MODE, I2C_NO_STARTSTOP);
            }
        } else {
            /* Wrong size Status regarding TCR flag event */
            /* Call the corresponding callback to inform upper layer of End of Transfer */
            I2C_ITError(handle, HAL_I2C_ERROR_SIZE);
        }
    } else if ((I2C_CHECK_FLAG(tmpITFlags, I2C_ISR_TC) != RESET) && (I2C_CHECK_IT_SOURCE(ITSources, I2C_CR1_TCIE) != RESET)) {
        /* Disable Interrupt related to address step */
        I2C_Disable_IRQ(handle, I2C_XFER_TX_IT);

        /* Enable ERR, TC, STOP, NACK and RXI interrupts */
        I2C_Enable_IRQ(handle, I2C_XFER_RX_IT);

        if (handle->State == HAL_I2C_STATE_BUSY_RX) {
            direction = I2C_GENERATE_START_READ;
        }

        if (handle->xferCount > MAX_NBYTE_SIZE) {
            handle->xferSize = MAX_NBYTE_SIZE;

            /* Set NBYTES to write and reload if hi2c->XferCount > MAX_NBYTE_SIZE and generate RESTART */
            I2C_TransferConfig(handle, (uint16_t) handle->DevAddress, (uint8_t) handle->xferSize, I2C_RELOAD_MODE, direction);
        } else {
            handle->xferSize = handle->xferCount;

            /* Set NBYTES to write and generate RESTART */
            I2C_TransferConfig(handle, (uint16_t) handle->DevAddress, (uint8_t) handle->xferSize, I2C_AUTOEND_MODE, direction);
        }
    } else {
        /* Nothing to do */
    }

    if ((I2C_CHECK_FLAG(tmpITFlags, I2C_ISR_STOPF) != RESET) && (I2C_CHECK_IT_SOURCE(ITSources, I2C_CR1_STOPIE) != RESET)) {
        /* Call I2C Master complete process */
        I2C_ITMasterCplt(handle, tmpITFlags);
    }

    return HAL_OK;
}

static void I2C_ITMasterCplt(I2C_Handle *handle, uint32_t ITFlags)
{
    uint32_t      tmperror;
    uint32_t      tmpITFlags = ITFlags;
    __IO uint32_t tmpreg;

    /* Clear STOP Flag */
    handle->Instance->ICR = I2C_ISR_STOPF;

    /* Disable Interrupts and Store Previous state */
    if (handle->State == HAL_I2C_STATE_BUSY_TX) {
        I2C_Disable_IRQ(handle, I2C_XFER_TX_IT);
        handle->PreviousState = I2C_STATE_MASTER_BUSY_TX;
    } else if (handle->State == HAL_I2C_STATE_BUSY_RX) {
        I2C_Disable_IRQ(handle, I2C_XFER_RX_IT);
        handle->PreviousState = I2C_STATE_MASTER_BUSY_RX;
    } else {
        /* Do nothing */
    }

    /* Clear Configuration Register 2 */
    (handle->Instance->CR2 &= (uint32_t) ~((uint32_t) (I2C_CR2_SADD | I2C_CR2_HEAD10R | I2C_CR2_NBYTES | I2C_CR2_RELOAD | I2C_CR2_RD_WRN)));

    /* Reset handle parameters */
    handle->xferISR     = NULL;
    handle->xferOptions = I2C_NO_OPTION_FRAME;

    // if ((((tmpITFlags) &I2C_ISR_STOPF) == I2C_ISR_STOPF ? SET : RESET) != RESET) {
    //     /* Clear NACK Flag */
    //     handle->Instance->ICR = I2C_ISR_NACKF;
    //
    //     /* Set acknowledge error code */
    //     handle->ErrorCode |= HAL_I2C_ERROR_AF;
    // }

    /* Fetch Last receive data if any */
    if ((handle->State == HAL_I2C_STATE_ABORT) && ((((tmpITFlags) &I2C_ISR_RXNE) == I2C_ISR_RXNE ? SET : RESET) != RESET)) {
        /* Read data from RXDR */
        tmpreg = (uint8_t) handle->Instance->RXDR;
        UNUSED(tmpreg);
    }

    /* Flush TX register */
    I2C_Flush_TXDR(handle);

    /* Store current volatile hi2c->ErrorCode, misra rule */
    tmperror = handle->ErrorCode;

    /* Call the corresponding callback to inform upper layer of End of Transfer */
    if ((handle->State == HAL_I2C_STATE_ABORT) || (tmperror != HAL_I2C_ERROR_NONE)) {
        /* Call the corresponding callback to inform upper layer of End of Transfer */
        I2C_ITError(handle, handle->ErrorCode);
    }
    /* hi2c->State == HAL_I2C_STATE_BUSY_TX */
    else if (handle->State == HAL_I2C_STATE_BUSY_TX) {
        handle->State         = HAL_I2C_STATE_READY;
        handle->PreviousState = I2C_STATE_NONE;

