bkempers/baremetal-rtos/HAL/src/stm32h7rs_hal_i2c.c
        if (handle->Mode == HAL_I2C_MODE_MEM) {
            handle->Mode = HAL_I2C_MODE_NONE;

            /* Call the corresponding callback to inform upper layer of End of Transfer */
            handle->memTxCpltCallback(handle);
        } else {
            handle->Mode = HAL_I2C_MODE_NONE;

            /* Call the corresponding callback to inform upper layer of End of Transfer */
            handle->masterTxCpltCallback(handle);
        }
    }
    /* hi2c->State == HAL_I2C_STATE_BUSY_RX */
    else if (handle->State == HAL_I2C_STATE_BUSY_RX) {
        handle->State         = HAL_I2C_STATE_READY;
        handle->PreviousState = I2C_STATE_NONE;

        if (handle->Mode == HAL_I2C_MODE_MEM) {
            handle->Mode = HAL_I2C_MODE_NONE;

            /* Call the corresponding callback to inform upper layer of End of Transfer */
            handle->memRxCpltCallback(handle);
        } else {
            handle->Mode = HAL_I2C_MODE_NONE;

            /* Call the corresponding callback to inform upper layer of End of Transfer */
            handle->masterRxCpltCallback(handle);
        }
    } else {
        /* Nothing to do */
    }
}

static void I2C_ITMasterSeqCplt(I2C_Handle *handle)
{
    /* Reset I2C handle mode */
    handle->Mode = HAL_I2C_MODE_NONE;

    /* No Generate Stop, to permit restart mode */
    /* The stop will be done at the end of transfer, when I2C_AUTOEND_MODE enable */
    if (handle->State == HAL_I2C_STATE_BUSY_TX) {
        handle->State         = HAL_I2C_STATE_READY;
        handle->PreviousState = I2C_STATE_MASTER_BUSY_TX;
        handle->xferISR       = NULL;

        /* Disable Interrupts */
        I2C_Disable_IRQ(handle, I2C_XFER_TX_IT);

        /* Call the corresponding callback to inform upper layer of End of Transfer */
        handle->masterTxCpltCallback(handle);
    }
    /* hi2c->State == HAL_I2C_STATE_BUSY_RX */
    else {
        handle->State         = HAL_I2C_STATE_READY;
        handle->PreviousState = I2C_STATE_MASTER_BUSY_RX;
        handle->xferISR       = NULL;

        /* Disable Interrupts */
        I2C_Disable_IRQ(handle, I2C_XFER_RX_IT);

        /* Call the corresponding callback to inform upper layer of End of Transfer */
        handle->masterRxCpltCallback(handle);
    }
}

static void I2C_ITError(I2C_Handle *handle, uint32_t ErrorCode)
{
    HAL_I2C_State tmpstate = handle->State;

    /* Reset handle parameters */
    handle->Mode        = HAL_I2C_MODE_NONE;
    handle->xferOptions = I2C_NO_OPTION_FRAME;
    handle->xferCount   = 0U;

    /* Set new error code */
    handle->ErrorCode |= ErrorCode;

    /* Disable Interrupts */
    if ((tmpstate == HAL_I2C_STATE_LISTEN) || (tmpstate == HAL_I2C_STATE_BUSY_TX_LISTEN) || (tmpstate == HAL_I2C_STATE_BUSY_RX_LISTEN)) {
        /* Disable all interrupts, except interrupts related to LISTEN state */
        I2C_Disable_IRQ(handle, I2C_XFER_RX_IT | I2C_XFER_TX_IT);

        /* keep HAL_I2C_STATE_LISTEN if set */
        handle->State = HAL_I2C_STATE_LISTEN;
        // TODO: implement later?
        // handle->xferISR       = I2C_Slave_ISR_IT;
    } else {
        /* Disable all interrupts */
        I2C_Disable_IRQ(handle, I2C_XFER_LISTEN_IT | I2C_XFER_RX_IT | I2C_XFER_TX_IT);

        /* Flush TX register */
        I2C_Flush_TXDR(handle);

        /* If state is an abort treatment on going, don't change state */
        /* This change will be do later */
        if (handle->State != HAL_I2C_STATE_ABORT) {
            /* Set HAL_I2C_STATE_READY */
            handle->State = HAL_I2C_STATE_READY;

            /* Check if a STOPF is detected */
            if ((((handle->Instance->ISR) & I2C_ISR_STOPF) == I2C_ISR_STOPF ? SET : RESET) == SET) {
                if (((((handle->Instance->ISR) & I2C_ISR_NACKF) == I2C_ISR_NACKF) ? SET : RESET) == SET) {
                    handle->Instance->ICR = I2C_ISR_NACKF;
                    handle->ErrorCode |= HAL_I2C_ERROR_AF;
                }

                /* Clear STOP Flag */
                handle->Instance->ICR = I2C_ISR_STOPF;
            }
        }
        handle->xferISR = NULL;
    }
    // TODO: implement DMA later
    I2C_TreatErrorCallback(handle);
}

static void I2C_TreatErrorCallback(I2C_Handle *handle)
{
    if (handle->State == HAL_I2C_STATE_ABORT) {
        handle->State         = HAL_I2C_STATE_READY;
        handle->PreviousState = (uint32_t) HAL_I2C_MODE_NONE;

        /* Call the corresponding callback to inform upper layer of End of Transfer */
        handle->abortCpltCallback(handle);
    } else {
        handle->PreviousState = (uint32_t) HAL_I2C_MODE_NONE;

        /* Call the corresponding callback to inform upper layer of End of Transfer */
        handle->errorCallback(handle);
    }
}

// HAL_Status HAL_I2C_Master_Seq_TX_IT(I2C_Handle *handle, uint16_t DevAddress, uint8_t *ptrData, uint16_t Size, uint32_t TXOptions) {}
// HAL_Status HAL_I2C_Master_Seq_RX_IT(I2C_Handle *handle, uint16_t DevAddress, uint8_t *ptrData, uint16_t Size, uint32_t TXOptions) {}

// HAL_Status HAL_I2C_Slave_Seq_TX_IT(I2C_Handle *handle, uint8_t *ptrData, uint16_t Size, uint32_t TXOptions);
// HAL_Status HAL_I2C_Slave_Seq_RX_IT(I2C_Handle *handle, uint8_t *ptrData, uint16_t Size, uint32_t TXOptions);

HAL_Status HAL_I2C_Master_Abort_IT(I2C_Handle *handle, uint16_t DevAddress)
{
    // TODO: implement later
    return HAL_OK;
}

void HAL_I2C_EV_IRQHandler(I2C_Handle *handle)
{
    /* Get current IT Flags and IT sources value */
    uint32_t itflags   = READ_REG(handle->Instance->ISR);
    uint32_t itsources = READ_REG(handle->Instance->CR1);

    /* I2C events treatment -------------------------------------*/
    if (handle->xferISR != NULL) {
        handle->xferISR(handle, itflags, itsources);
    }
}

void HAL_I2C_ER_IRQHandler(I2C_Handle *handle)
{
    uint32_t itflags   = READ_REG(handle->Instance->ISR);
    uint32_t itsources = READ_REG(handle->Instance->CR1);
    uint32_t tmperror;

    /* I2C Bus error interrupt occurred ------------------------------------*/
    if ((((((itflags) &I2C_ISR_BERR) == I2C_ISR_BERR) ? SET : RESET) != RESET) &&
        (((((itsources) & (I2C_CR1_ERRIE)) == (I2C_CR1_ERRIE)) ? SET : RESET) != RESET)) {
        handle->ErrorCode |= HAL_I2C_ERROR_BERR;
        handle->Instance->ICR = I2C_ISR_BERR;
    }

    /* I2C Over-Run/Under-Run interrupt occurred ----------------------------------------*/
    if ((((((itflags) &I2C_ISR_OVR) == I2C_ISR_OVR) ? SET : RESET) != RESET) &&
        (((((itsources) & (I2C_CR1_ERRIE)) == (I2C_CR1_ERRIE)) ? SET : RESET) != RESET)) {
        handle->ErrorCode |= HAL_I2C_ERROR_OVR;
        handle->Instance->ICR = I2C_ISR_OVR;
    }

