bkempers/baremetal-rtos/HAL/src/stm32h7rs_hal_i2c.c
    /* I2C Arbitration Loss error interrupt occurred -------------------------------------*/
    if ((((((itflags) &I2C_ISR_ARLO) == I2C_ISR_ARLO) ? SET : RESET) != RESET) &&
        (((((itsources) & (I2C_CR1_ERRIE)) == (I2C_CR1_ERRIE)) ? SET : RESET) != RESET)) {
        handle->ErrorCode |= HAL_I2C_ERROR_ARLO;
        handle->Instance->ICR = I2C_ISR_ARLO;
    }

    /* Store current volatile hi2c->ErrorCode, misra rule */
    tmperror = handle->ErrorCode;

    /* Call the Error Callback in case of Error detected */
    if ((tmperror & (HAL_I2C_ERROR_BERR | HAL_I2C_ERROR_OVR | HAL_I2C_ERROR_ARLO)) != HAL_I2C_ERROR_NONE) {
        I2C_ITError(handle, tmperror);
    }
}

__weak void HAL_I2C_MasterTxCpltCallback(I2C_Handle *handle)
{
    UNUSED(handle);
}

__weak void HAL_I2C_MasterRxCpltCallback(I2C_Handle *handle)
{
    UNUSED(handle);
}

__weak void HAL_I2C_ListenCpltCallback(I2C_Handle *handle)
{
    UNUSED(handle);
}

__weak void HAL_I2C_MemTxCpltCallback(I2C_Handle *handle)
{
    UNUSED(handle);
}

__weak void HAL_I2C_MemRxCpltCallback(I2C_Handle *handle)
{
    UNUSED(handle);
}

__weak void HAL_I2C_ErrorCallback(I2C_Handle *handle)
{
    UNUSED(handle);
}

__weak void HAL_I2C_AbortCpltCallback(I2C_Handle *handle)
{
    UNUSED(handle);
}

HAL_I2C_State HAL_I2C_GetState(const I2C_Handle *handle)
{
    return handle->State;
}

HAL_I2C_Mode HAL_I2C_GetMode(const I2C_Handle *handle)
{
    return handle->Mode;
}

uint32_t HAL_I2C_GetError(const I2C_Handle *handle)
{
    return handle->ErrorCode;
}
